[
  {
    "id": "1",
    "title": "Difference between Authentication and Authorization",
    "description":"<strong>Authentication:</strong>: In authentication process, the identity of users are checked for providing the access to the system.In authentication process, users or persons are verified.It is done before the authorization process.It needs usually user’s login details.Authentication determines whether the person is user or not. <strong>Authorization:</strong> While in authorization process, person’s or user’s authorities are checked for accessing the resources.While in this process, users or persons are validated.While this process is done after the authentication process.While it needs user’s privilege or security levels.While it determines What permission do user have?",
    "img" :"https://i.ibb.co/kQgncGN/Screenshot-4.png"
  },
  {
    "id": "2",
    "title": "Why are you using firebase? What other options do you have to implement authentication?",
    "description":"It’s easy to start a project with Firebase or add a Firebase to your project. It allows real-time database connection, which means multiple users can see the changes in the data when the data gets created or edited.The same applies for file storage. Quick setup authentication via the major providers (Google, Twitter, Facebook, GitHub). Https by default - secure http traffic without setting up certificates. Any static html/javascript content can be hosted.some common authentication methods used to secure modern systems.1. Password-based authentication 2. Multi-factor authentication 3. Certificate-based authentication 4. Biometric authentication 5.Token-based authentication",
    "img" :"https://i.ibb.co/JCn7vy2/firebase11.jpg"
  },
  {
    "id": "3",
    "title": "What other services does firebase provide other than authentication?",
    "description":" It provides different kinds of services that help you to develop high-quality mobile and web applications to grow your business.Firebase is a full package that can help in developing your mobile or web applications faster with fewer resources and more efficiency.There are many services which Firebase provides, Most useful of them are:1. Cloud Firestore 2.Cloud Functions 3.Authentication 4.Hosting 5.Cloud Storage 6.Google Analytics 7.Predictions 8.Cloud Messaging 9.Dynamic Links 10.Remote Config etc.",
    "img" :"https://i.ibb.co/7WpbL0w/wgh5fjp7v2ss605bnlvn.png"
  }
]
